{
  "english": {
    "select": "EN",
    "navbar": {
      "home": "Home",
      "skills": "Skills",
      "experiences": "Experiences",
      "myCV": "My Curriculum Vitae"
    },
    "banner": {
      "welcome": "Welcome to my Portfolio",
      "hello": "Hi Im Jeremías Dominguez Vega",
      "toRotate": {
        "toRotate": [
          "FrontEnd Developer",
          "Computer Engineer",
          "Web Developer",
          "React.Js Developer"
        ]
      },
      "presentation": "I am a proactive, organized and responsible person, with good interpersonal relationships. I always have the best disposition to carry out my work. I am looking for a position where I can display all my acquired knowledge, as well as continue learning in the area and gain experience."
    },
    "skills": {
      "title": "Skills",
      "introduction": "My skills as a web developer include a solid understanding of HTML, CSS, JavaScript, Typescript y Tailwind, experience with responsive websites, and familiarity with frameworks like Next and React. I am a passionate problem solver and am always looking for opportunities to grow and learn."
    },
    "projects": {
      "title": "Experiences",
      "introduction": "Allow me to present you a sample of my works, projects and other practices. In my career, I have developed web applications such as Milenium Gym, which offers user management, routines and nutritional plans. I have also updated the Palomba Bienes Raices web design in WordPress. Additionally, I have worked on Handshape Dataset, a Python library for sign language image processing. In the area of ​​projects, I highlight Bonus Hunt Tracker, a web app to track and obtain bonus statistics in online slots, as well as Money Manager, an app for the management and management of income/expenses, with graphic visualization of the balance. I am currently working on a personal venture together with a team, in the development of an App for business management, in principle, oriented to the sports/gyms field. I have also carried out various practices in my Github repository, using frameworks and languages ​​such as React.Js, Node.Js, Javascript and Python. Explore and discover more about my work!",
      "tabOne": "Works",
      "tabTwo": "Projects",
      "tabThree": "Other Practices",
      "works": [
        {
          "title1": "Milenium Gym",
          "description1": "Web app development for managing gym users. It allows adding routines and nutritional plans to users subscribed to it, as well as notifying them of their next payment."
        },
        {
          "title2": "Palomba Bienes Raices",
          "description2": "WordPress web design update from Figma template."
        },
        {
          "title3": "Handshape Dataset",
          "description3": "Logic and library programming for handling different sign language images countries."
        }
      ],
      "projects": [
        {
          "title1": "Bonus Hunt Tracker",
          "description1": "Web application to display real-time performance statistics on online slots. Developed in React + Vite with the use of a database in Supabase."
        },
        {
          "title2": "Money Manager",
          "description2": "Financial management web app that provides detailed expense tracking, income recording and graphical data visualization. The backend, developed with Supabase. The frontend, built with react.js + vite, uses styled-components, chart.js and axios for a complete and efficient financial management experience."
        },
        {
          "title3": "Penta (Entrepreneurship)",
          "description3": "Creation of Web App for monitoring, both statistical and logistical, for businesses, in principle, in the sports field. Developed in Next 14 complemented with a Ruby backend.."
        }
      ],
      "others": [
        {
          "title1": "Others projects - Github",
          "description1": "Various projects in practice mode, using frameworks/languages ​​such as Next.Js, React.Js, Node.Js, Javascript, among others."
        }
      ]
    },
    "contact": {
      "title": "Get In Touch",
      "form": {
        "firstName": "First Name",
        "lastName": "Last Name",
        "phone": "Phone",
        "message": "Message",
        "button": {
          "send": "Send",
          "sending": "Sending..."
        },
        "messageStatus": {
          "messageTrue": "Message sent successfully.",
          "messageFalse": "Something went wrong, please try again later."
        }
      }
    },
    "footer": {
      "copyright": "All Right Reserved"
    }
  },
  "spanish": {
    "select": "ES",
    "navbar": {
      "home": "Inicio",
      "skills": "Aptitudes",
      "experiences": "Experiencias",
      "myCV": "Mi Curriculum Vitae"
    },
    "banner": {
      "welcome": "Bienvenido/a a mi Portfolio",
      "hello": "Hola soy Jeremías Dominguez Vega",
      "toRotate": {
        "toRotate": [
          "Desarrollador FrontEnd",
          "Ingeniero en Computación",
          "Desarrollador Web",
          "Desarrollador React.Js"
        ]
      },
      "presentation": "Soy una persona proactiva, organizada y responsable, con buenas relaciones interpersonales. Siempre tengo la mejor disposición para realizar mi trabajo. Busco un puesto donde pueda desplegar todos mis conocimientos adquiridos, así como seguir aprendiendo en el área y adquirir experiencia."
    },
    "skills": {
      "title": "Aptitudes",
      "introduction": "Mis habilidades como desarrollador web incluyen conocimientos sólidos en HTML, CSS, JavaScript, Typescript y Tailwind, experiencia en sitios web responsivos y familiaridad con frameworks como Next y React. Soy un solucionador de problemas apasionado y siempre estoy buscando oportunidades para crecer y aprender."
    },
    "projects": {
      "title": "Experiencias",
      "introduction": "Permíteme presentarte una muestra de mis trabajos, proyectos y otras prácticas. En mi trayectoria, he desarrollado aplicaciones web como Milenium Gym, que ofrece gestión de usuarios, rutinas y planes nutricionales. También he actualizado el diseño web de Palomba Bienes Raices en WordPress. Además, he trabajado en Handshape Dataset, una biblioteca de Python para procesamiento de imágenes de lengua de señas. En el ámbito de proyectos, destaco Bonus Hunt Tracker, una app web para realizar seguimiento y obtener estadisticas de bonus en slots online, así como tambien Money Manager, una app para el manejo y gestión de ingresos/gastos, con visualización gráfica de balance. Actualmente estoy trabajando en un emprendimiento personal junto a un equipo, en el desarrollo de una App para gestión de negocios, en principio, orientados al ámbito deportivo/gimnasios. También he realizado diversas prácticas en mi repositorio de Github, utilizando frameworks y lenguajes como React.Js, Node.Js, Javascript y Python. ¡Explora y descubre más sobre mi trabajo!",
      "tabOne": "Trabajos",
      "tabTwo": "Proyectos",
      "tabThree": "Otras Prácticas",
      "works": [
        {
          "title1": "Milenium Gym",
          "description1": "Desarrollo app web para manejo de usuarios de gimnasio. Permite añadir rutinas y planes nutricionales a los usuarios suscritos al mismo, así como también notificarles su próximo pago."
        },
        {
          "title2": "Palomba Bienes Raices",
          "description2": "Actualización diseño web en WordPress a partir de plantilla Figma."
        },
        {
          "title3": "Handshape Dataset",
          "description3": "Lógica y programación de librería para manejo de imágenes de lengua de señas de diferentes países."
        }
      ],
      "projects": [
        {
          "title1": "Bonus Hunt Tracker",
          "description1": "Aplicación web para mostrar estadísticas en tiempo real de performance en slots online. Desarrollada en React + Vite con utilización de base de datos en Supabase."
        },
        {
          "title2": "Gestor Financiero",
          "description2": "App web de gestión financiera que brinda seguimiento detallado de gastos, registro de ingresos, y visualización gráfica de datos. El backend, desarrollado con Supabase. El frontend, creado con react.js + vite, utiliza styled-components, chart.js y axios para una experiencia completa y eficiente de gestión financiera."
        },
        {
          "title3": "Penta (Emprendimiento)",
          "description3": "Creación de App Web para seguimiento, tanto estadístico como logístico, para negocios, en principio, del ambito deportivo. Desarrolado en Next 14 complementado con un backend en Ruby."
        }
      ],
      "others": [
        {
          "title1": "Otras Prácticas - Github",
          "description1": "Diversos proyectos en modo de práctica, utilizando frameworks/lenguajes como por ejemplo Next.Js, React.Js, Node.Js, Javascript, entre otros."
        }
      ]
    },
    "contact": {
      "title": "Ponerse en contacto",
      "form": {
        "firstName": "Nombre",
        "lastName": "Apellido",
        "phone": "Teléfono",
        "message": "Mensaje",
        "button": {
          "send": "Enviar",
          "sending": "Enviando..."
        },
        "messageStatus": {
          "messageTrue": "Mensaje enviado con éxito.",
          "messageFalse": "Algo salió mal, inténtalo nuevamente más tarde."
        }
      }
    },
    "footer": {
      "copyright": "Todos los derechos reservados"
    }
  }
}